In [ ]:
## \#05: Membalik urutan baris dan kolom pada Data Frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [ ]:
### Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  3  2  9  1
1  4  3  4  7  4
2  5  5  8  1  2
3  9  7  9  1  8
4  3  7  4  5  1

In [ ]:
### Membalik urutan kolom

In [5]:
df.loc[:, ::-1]

   E  D  C  B  A
0  1  9  2  3  8
1  4  7  4  3  4
2  2  1  8  5  5
3  8  1  9  7  9
4  1  5  4  7  3

In [ ]:
### Membalik urutan baris

In [7]:
df.loc[::-1]

   A  B  C  D  E
4  3  7  4  5  1
3  9  7  9  1  8
2  5  5  8  1  2
1  4  3  4  7  4
0  8  3  2  9  1

In [ ]:
### Membalik urutan baris dan melakukan penyesuaian ulang `index`

In [9]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  7  4  5  1
1  9  7  9  1  8
2  5  5  8  1  2
3  4  3  4  7  4
4  8  3  2  9  1